БСХП_копия_фреша.РасширениеЕАС/src/Catalogs/ЕАС_ПоляФормШаблонов/ЕАС_ПоляФормШаблонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЕАС_ПоляФормШаблонов</name>
  <owners>Catalog.ЕАС_ШаблоныОтчетов</owners>
  <attributes>
    <name>ОбластьДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательОтчета</name>
    <type>
      <types>CatalogRef.ЕАС_ПоказателиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>EnumRef.ЕАС_ВидыИсточниковДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопПараметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьЧисла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

БСХП_копия_фреша.РасширениеЕАС/src/Enums/ЕАС_ВидыИсточниковДанных/ЕАС_ВидыИсточниковДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЕАС_ВидыИсточниковДанных</name>
  <enumValues>
    <name>Факт</name>
    <comment>Факт (из данных БСХП)</comment>
  </enumValues>
  <enumValues>
    <name>План</name>
    <comment>План (из данных ЕАС)</comment>
  </enumValues>
</mdclass:Enum>

БСХП_копия_фреша.РасширениеЕАС/src/Catalogs/ЕАС_ПоляФормШаблонов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
	ЕАС_ОбластиДанныхКопируемый.НазначитьОбластьДанных(ЭтотОбъект);
	
	ЕАС_ОбменВызовСервераКопируемый.ЗарегистрироватьИзмененияСправочника(ЭтотОбъект);
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;	
	
	ПроверкаУникальности(Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Перем ДанныеВладелец, ЗначениеКопирования;
	
	Если ТипЗнч(ДанныеЗаполнения)= Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Владелец", ДанныеВладелец) Тогда
			Владелец = ДанныеВладелец;       
			
		ИначеЕсли  ДанныеЗаполнения.Свойство("ЗначениеКопирования", ЗначениеКопирования)
						И ТипЗнч(ЗначениеКопирования) = ТипЗнч(Ссылка) Тогда	
			Для Каждого Реквизит Из ЗначениеКопирования.Метаданные().Реквизиты Цикл
				ЭтотОбъект[Реквизит.Имя] = ЗначениеКопирования[Реквизит.Имя]; 
			КонецЦикла;
			Владелец = ЗначениеКопирования.Владелец;
		КонецЕсли;
		
	КонецЕсли;         
	
	Если Не ЗначениеЗаполнено(Источник) Тогда
		Источник = Перечисления.ЕАС_ВидыИсточниковДанных.Факт;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала    = НачалоГода(ТекущаяДатаСеанса());
		ДатаОкончания = КонецГода(ТекущаяДатаСеанса());
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	ЕАС_ОбменВызовСервераКопируемый.ЗарегистрироватьИзмененияСправочника(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаУникальности(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПоляФормШаблонов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЕАС_ПоляФормШаблонов КАК ПоляФормШаблонов
	               |ГДЕ
	               |	ПоляФормШаблонов.Владелец = &Владелец
	               |	И ПоляФормШаблонов.ПоказательОтчета = &ПоказательОтчета
	               |	И ПоляФормШаблонов.ОбластьДанных = &ОбластьДанных
	               |	И ПоляФормШаблонов.Источник = &Источник
	               |	И ПоляФормШаблонов.ДатаНачала = &ДатаНачала
	               |	И ПоляФормШаблонов.ДатаОкончания = &ДатаОкончания
	               |	И ПоляФормШаблонов.ЕдиницаИзмерения = &ЕдиницаИзмерения
	               |	И ПоляФормШаблонов.ДопПараметр = &ДопПараметр
	               |	И ПоляФормШаблонов.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Владелец",               Владелец);
	Запрос.УстановитьПараметр("ОбластьДанных",       	ОбластьДанных);
	Запрос.УстановитьПараметр("ПоказательОтчета",       ПоказательОтчета);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",       ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("Источник",               Источник);
	Запрос.УстановитьПараметр("ДатаНачала",             ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",          ДатаОкончания);
	Запрос.УстановитьПараметр("ДопПараметр", 			ДопПараметр);
	Запрос.УстановитьПараметр("Ссылка", 				Ссылка);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		ТекстСообщения = НСтр("ru='Элемент с такими параметрами расчета уже имеется.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
